- helps in numerical computing (NumPy, SciPy)
- helps with analytical libraries (scikit-learn, and data visualizatioon, 
- processes data without for loops

# Data structures
- Series
- Data Frames
- index objects

# Functionality
- Reindexing
- Dropping entreies from axis
- indexing, selection, and filtering
- DataFrame selection with loc and iloc
- integer indexing pitfalls
- pitfalls with chained indexing
- artihmetic and data alignment
- arithmetic methods with fill values
- Operations between DataFrame and Series
- Function applicaiton and mapping
- Sorting and Ranking
- Axis indexed with dupicate labels
# Summarizing and Descriptive statistics
- correlation and variance
- unique values, counts, and memberships

## Series

In [8]:
import pandas as pd

import numpy as np

from pandas import Series, DataFrame

In [2]:
obj = pd.Series([4,2, 312, -3])

obj

0      4
1      2
2    312
3     -3
dtype: int64

In [5]:
obj2 = pd.Series([4,2, 312, -3], index = ['a', 'b', 'c', 'd'])

obj2

a      4
b      2
c    312
d     -3
dtype: int64

In [6]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
obj2[obj2 > 0]

a      4
b      2
c    312
dtype: int64

In [9]:
np.exp(obj2)

a     5.459815e+01
b     7.389056e+00
c    3.161392e+135
d     4.978707e-02
dtype: float64

In [10]:
'b' in obj2

True

In [11]:
'e' in obj2

False

In [13]:
sdata = {'ohio': 232, 'Texas': 332, 'Oregon': 34343}

obj3 = pd.Series(sdata)

obj3

ohio        232
Texas       332
Oregon    34343
dtype: int64

In [14]:
obj3.to_dict()

{'ohio': 232, 'Texas': 332, 'Oregon': 34343}

In [15]:
states = ['California', 'ohio', 'orgeon']

obj4 = pd.Series(sdata, index = states)

obj4

California      NaN
ohio          232.0
orgeon          NaN
dtype: float64

In [16]:
pd.isna(obj4) # is null

California     True
ohio          False
orgeon         True
dtype: bool

In [18]:
pd.notna(obj4)  #not null

California    False
ohio           True
orgeon        False
dtype: bool

In [19]:
obj3 + obj4

California      NaN
Oregon          NaN
Texas           NaN
ohio          464.0
orgeon          NaN
dtype: float64

In [20]:
obj4.name = 'population'

obj4.index.name = 'state'

obj4

state
California      NaN
ohio          232.0
orgeon          NaN
Name: population, dtype: float64

In [21]:
obj

0      4
1      2
2    312
3     -3
dtype: int64

In [23]:
# altering the index in place

obj.index = ['Kunal', 'Rahul', 'Raghav', 'Ryan']

obj

Kunal       4
Rahul       2
Raghav    312
Ryan       -3
dtype: int64

## [DataFrame](https://learning.oreilly.com/library/view/python-for-data/9781098104023/ch05.html#table_dataframe_constructor)

In [26]:
data = {'state': ['ohio', 'ohio', 'nevada',], 
       'year': [2000, 2001, 2002,], 
       'pop': [1.2, 1.3, 1.4,]}

frame = pd.DataFrame(data)

In [27]:
frame

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2  nevada  2002  1.4

In [29]:
frame.head()

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2  nevada  2002  1.4

In [30]:
frame.tail()

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2  nevada  2002  1.4

In [31]:
# passing another column in the dataframe

frame2 = pd.DataFrame(data, columns = ['state', 'year', 'pop', 'debt'])

frame2

    state  year  pop debt
0    ohio  2000  1.2  NaN
1    ohio  2001  1.3  NaN
2  nevada  2002  1.4  NaN

In [34]:
# changing the order of columns


frame2 = pd.DataFrame(data, columns = [ 'year', 'pop', 'debt', 'state'])

In [33]:
frame2

   year  pop debt   state
0  2000  1.2  NaN    ohio
1  2001  1.3  NaN    ohio
2  2002  1.4  NaN  nevada

In [35]:
frame2.year

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [36]:
frame2.loc[1]

year     2001
pop       1.3
debt      NaN
state    ohio
Name: 1, dtype: object

In [37]:
frame2.iloc[2]

year       2002
pop         1.4
debt        NaN
state    nevada
Name: 2, dtype: object

In [38]:
frame2.pop

<bound method DataFrame.pop of    year  pop debt   state
0  2000  1.2  NaN    ohio
1  2001  1.3  NaN    ohio
2  2002  1.4  NaN  nevada>

In [39]:
frame2.year

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [40]:
# assigning values

frame2['debt'] = 14.5

frame2

   year  pop  debt   state
0  2000  1.2  14.5    ohio
1  2001  1.3  14.5    ohio
2  2002  1.4  14.5  nevada

In [42]:
# assiging a new column (resuls in new column if it does not exist before)

frame2['eastern'] = frame2['state']  =='ohio'

frame2

   year  pop  debt   state  eastern
0  2000  1.2  14.5    ohio     True
1  2001  1.3  14.5    ohio     True
2  2002  1.4  14.5  nevada    False

In [44]:
# transposing
frame2.T

            0     1       2
year     2000  2001    2002
pop       1.2   1.3     1.4
debt     14.5  14.5    14.5
state    ohio  ohio  nevada
eastern  True  True   False

In [51]:
pd.DataFrame(data)

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2  nevada  2002  1.4

In [52]:
frame2.index.name = 'year'

In [56]:
frame2.columns.name = 'state'  # starts with state column

In [54]:
frame2

state  year  pop  debt   state  eastern
year
0      2000  1.2  14.5    ohio     True
1      2001  1.3  14.5    ohio     True
2      2002  1.4  14.5  nevada    False

In [57]:
frame2.to_numpy()

array([[2000, 1.2, 14.5, 'ohio', True],
       [2001, 1.3, 14.5, 'ohio', True],
       [2002, 1.4, 14.5, 'nevada', False]], dtype=object)

## [index objects](https://learning.oreilly.com/library/view/python-for-data/9781098104023/ch05.html#table_index_methods)

In [60]:
obj4 = pd.Series(np.arange(3), index = ['a', 'b', 'c'])

index = obj4.index


index

Index(['a', 'b', 'c'], dtype='object')

In [61]:
index [1:]

Index(['b', 'c'], dtype='object')

In [63]:
# index objects are immutable

index[1]= 'd' #type error

TypeError: Index does not support mutable operations

In [64]:
labels = pd.Index(np.arange(3))

labels

Index([0, 1, 2], dtype='int32')

In [65]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)


obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [67]:
obj2.index is labels

True

In [69]:
frame2

state  year  pop  debt   state  eastern
year
0      2000  1.2  14.5    ohio     True
1      2001  1.3  14.5    ohio     True
2      2002  1.4  14.5  nevada    False

In [70]:
frame2.columns

Index(['year', 'pop', 'debt', 'state', 'eastern'], dtype='object', name='state')

In [71]:
2003 in frame2.index

False

In [72]:
# unlike python, a pandas index can contain duplicate labels

pd.Index (['foo', 'boo', 'bar', 'baa', 'etc', 'foo'])

Index(['foo', 'boo', 'bar', 'baa', 'etc', 'foo'], dtype='object')